<?php

$arrWishes = [
    "удачи",
    "веселья",
    "лагополучия",
    "любви",
    "понимания",
    "заботы",
    "внимания",
    "жизнерадостности",
    "дружбы",
    "искренности",
    "тепла",
    "молодости",
    "улыбок",
    "бодрости",
    "солнца",
    "успеха",
    "долголетия",
    "обаяния",
    "красоты",
    "целеустремленности",
    "работоспособности",
    "адекватности",
    "профессионализма",
    "ума",
    "сообразительности",
];

$arrEpithets = [
    "удачного",
    "Любящего",
    "жаркого",
    "пламянного",
    "ромонтического",
    "крепкого",
    "сильного",
    "замечательного",
    "идеального",
    "желанного",
];

$name = readline("Введите имя ");

$wishes = array_rand($arrWishes, 3);
$epithets = array_rand($arrEpithets, 3);

echo "Дорогой $name, от всего сердца поздравляю тебя с днем рождения, желаю {$arrEpithets[$epithets[0]]} {$arrWishes[$wishes[0]]}, {$arrEpithets[$epithets[1]]} {$arrWishes[$wishes[1]]} и {$arrEpithets[$epithets[2]]} {$arrWishes[$wishes[2]]} !";

